Revit 2024 API
BuiltInFailures.ExtrusionFailures.ExtrusionTooThin Property
 Extrusion is too thin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ExtrusionTooThin { get; }
Visual Basic
Public Shared ReadOnly Property ExtrusionTooThin As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ExtrusionTooThin {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ExtrusionFailures Class
Autodesk.Revit.DB Namespace